#### InitialColor Members

---

|  |
| --- |
| InitialColor Class   Methods   Properties   See Also |

The  InitialColor  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Clone | Creates a copy of the InitialColor derived object. |
| Public method | Dispose | Releases all resources used by the  InitialColor |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | TemperatureValue | The light color temperature value in Kelvins. |

# See Also

InitialColor Class

Autodesk.Revit.DB.Lighting Namespace